Обработки/Reports/_ОтчетОСостоянииПортфеляПоФинансовымИнструментам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОСостоянииПортфеляПоФинансовымИнструментам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОСостоянииПортфеляПоФинансовымИнструментам/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о состоянии портфеля по финансовым инструментам",
		"0.15",
		"",
		Истина);
		                                                                                             
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант	= НастройкиОтчета.Подписант.КонтактноеЛицо;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");

	Возврат Настройки;

КонецФункции

Процедура Сформировать(ДокументРезультат)  Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст  = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии)
		|				ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КомиссияБиржа,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствамОбороты.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии)
		|				ТОГДА ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КомиссияБрокера,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход) КАК СуммаПриход,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание
		|ПОМЕСТИТЬ _КомиссияБрокера
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			,
		|			,
		|			Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СтоимостьПереоценки.Период КАК Период,
		|	СтоимостьПереоценки.ЦенаКотировки КАК ЦенаКотировки
		|ПОМЕСТИТЬ _СправедливыеЦены
		|ИЗ
		|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
		|ГДЕ
		|	СтоимостьПереоценки.Организация = &Организация
		|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СтоимостьПереоценки.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)
		|	И ВЫРАЗИТЬ(СтоимостьПереоценки.Регистратор КАК Документ.РегистрацияСтоимостиПереоценки).ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ЕдиныйПланСчетов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК ЦеннаяБумага,
		|	КодыВТорговыхСистемахСрезПоследних.Код КАК ISIN,
		|	БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК РегНомер,
		|	БухПартииЦенныхБумагОстаткиЕПС.Партия КАК Партия,
		|	БухПартииЦенныхБумагОстаткиЕПС.СтрокаПартии КАК СтрокаПартии,
		|	ВЫБОР
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки ЕСТЬ NULL
		|			ТОГДА БухПартииЦенныхБумагОстаткиЕПС.Партия.Дата
		|		КОГДА ВводЦенныхБумагЦенныеБумаги.ДатаПокупки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.Ссылка.Дата
		|		ИНАЧЕ ВводЦенныхБумагЦенныеБумаги.ДатаПокупки
		|	КОНЕЦ КАК ДатаПартии,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиЕПС.Партия) = ТИП(Документ.Сделка)
		|			ТОГДА БухПартииЦенныхБумагОстаткиЕПС.Партия.НомерСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(БухПартииЦенныхБумагОстаткиЕПС.Партия) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.Партия КАК Документ.ИсполнениеОбязательствПоСделке).Основание.НомерСделки
		|	КОНЕЦ КАК НомерСделки,
		|	БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага.ВалютаНоминала КАК ВалютаНоминала,
		|	БухПартииЦенныхБумагОстаткиЕПС.КоличествоОстаток КАК КоличествоОстаток,
		|	БухПартииЦенныхБумагОстаткиЕПС.СтоимостьВВалютеУчетаОстаток КАК СтоимостьОстаток,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.ДисконтПремияПокупкиОстаток < 0
		|			ТОГДА БухПартииЦенныхБумагОстаткиЕПС.ДисконтПремияНачисленныйВВалютеУчетаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокДисконта,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.ДисконтПремияПокупкиОстаток > 0
		|			ТОГДА БухПартииЦенныхБумагОстаткиЕПС.ДисконтПремияНачисленныйВВалютеУчетаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстатокПремия,
		|	БухПартииЦенныхБумагОстаткиЕПС.СтоимостьКупонаВВалютеУчетаОстаток КАК НКДуплаченный,
		|	БухПартииЦенныхБумагОстаткиЕПС.ПереоценкаКупонаВВалютеУчетаОстаток КАК НКДНачисленный,
		|	БухПартииЦенныхБумагОстаткиЕПС.ПереоценкаВВалютеУчетаОстаток КАК Переоценка,
		|	БухПартииЦенныхБумагОстаткиЕПС.КорректировкаЭСПВВалютеУчетаОстаток + БухПартииЦенныхБумагОстаткиЕПС.РазницаПервоначальногоПризнанияНеНаблюдаемыеДанныеВВалютеУчетаОстаток КАК Корректировка,
		|	БухПартииЦенныхБумагОстаткиЕПС.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение,
		|	БухПартииЦенныхБумагОстаткиЕПС.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгам,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстаткиНУ.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток, 0) КАК КомиссияОстаток,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Партия ССЫЛКА Документ.ВводЦенныхБумаг
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.Количество
		|		ИНАЧЕ ЕСТЬNULL(СделкаЦенныеБумаги.Количество, ИсполнениеОбязательствПоСделкеЦенныеБумаги.Количество)
		|	КОНЕЦ КАК КоличествоПокупка,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Партия ССЫЛКА Документ.ВводЦенныхБумаг
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.Сумма
		|		ИНАЧЕ ЕСТЬNULL(СделкаЦенныеБумаги.Сумма, ИсполнениеОбязательствПоСделкеЦенныеБумаги.Сумма)
		|	КОНЕЦ КАК СуммаПокупка,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Партия ССЫЛКА Документ.ВводЦенныхБумаг
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.Сумма / ВводЦенныхБумагЦенныеБумаги.Количество
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Партия ССЫЛКА Документ.РеклассификацияАктивовЕПС
		|			ТОГДА (ВЫРАЗИТЬ(РеклассификацияАктивовЕПСПартии.СуммаПокупки КАК ЧИСЛО(27, 12))) / РеклассификацияАктивовЕПСПартии.Количество
		|		ИНАЧЕ ЕСТЬNULL(СделкаЦенныеБумаги.Цена, ИсполнениеОбязательствПоСделкеЦенныеБумаги.Цена)
		|	КОНЕЦ КАК ЦенаПокупка,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.Партия ССЫЛКА Документ.ВводЦенныхБумаг
		|			ТОГДА ВводЦенныхБумагЦенныеБумаги.СуммаКупона
		|		ИНАЧЕ ЕСТЬNULL(СделкаЦенныеБумаги.СуммаКупона, ИсполнениеОбязательствПоСделкеЦенныеБумаги.СуммаКупона)
		|	КОНЕЦ КАК СуммаКупонаПокупка,
		|	ЕСТЬNULL(ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка.Основание, БухПартииЦенныхБумагОстаткиЕПС.Партия) КАК Основание,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстаткиНУ.СтоимостьПокупкиОстаток, 0) КАК СтоимостьОстатокНУ,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстаткиНУ.СтоимостьКупонаВВалютеУчетаОстаток, 0) КАК НКДУплаченныйНУ,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстаткиНУ.ПереоценкаКупонаВВалютеУчетаОстаток, 0) КАК НКДНачисленныйНУ,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстаткиНУ.РасходыПриПокупкеВСтоимостиВВалютеУчетаОстаток, 0) КАК КомиссияОстатокНУ,
		|	БухПартииЦенныхБумагОстаткиЕПС.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценениеНУ,
		|	БухПартииЦенныхБумагОстаткиЕПС.СуммаРезервовПоСомнительнымДолгамОстаток КАК СуммаРезервовПоСомнительнымДолгамНУ,
		|	УчетныеАктивыЕПС.СчетУчета КАК СчетУчета,
		|	БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага.УчетныйАктивЦБРФ КАК ЦеннаяБумагаУчетныйАктивЦБРФ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА НоминалыЦенныхБумагСрезПоследних.Номинал
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Акции).Номинал
		|	КОНЕЦ КАК Номинал,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага КАК Справочник.Облигации).ДатаПогашения
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК ДатаПогашения,
		|	БухПартииЦенныхБумагОстаткиЕПС.ИндексацияНоминалаОстаток КАК ИндексацияНоминала,
		|	ЕСТЬNULL(БухПартииЦенныхБумагОстаткиНУ.ИндексацияНоминалаОстаток, 0) КАК ИндексацияНоминалаНУ
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			&ОтчетнаяДата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОстаткиЕПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних КАК КодыВТорговыхСистемахСрезПоследних
		|		ПО БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследних.Объект
		|			И (КодыВТорговыхСистемахСрезПоследних.ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.ISIN))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводЦенныхБумаг.ЦенныеБумаги КАК ВводЦенныхБумагЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстаткиЕПС.Партия = ВводЦенныхБумагЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстаткиЕПС.СтрокаПартии = ВводЦенныхБумагЦенныеБумаги.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				&ОтчетнаяДата,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)) КАК БухПартииЦенныхБумагОстаткиНУ
		|		ПО БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага = БухПартииЦенныхБумагОстаткиНУ.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОстаткиЕПС.Партия = БухПартииЦенныхБумагОстаткиНУ.Партия
		|			И БухПартииЦенныхБумагОстаткиЕПС.СтрокаПартии = БухПартииЦенныхБумагОстаткиНУ.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке.ЦенныеБумаги КАК ИсполнениеОбязательствПоСделкеЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага = ИсполнениеОбязательствПоСделкеЦенныеБумаги.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОстаткиЕПС.Партия = ИсполнениеОбязательствПоСделкеЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстаткиЕПС.СтрокаПартии = ИсполнениеОбязательствПоСделкеЦенныеБумаги.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка.ЦенныеБумаги КАК СделкаЦенныеБумаги
		|		ПО БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага = СделкаЦенныеБумаги.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОстаткиЕПС.Партия = СделкаЦенныеБумаги.Ссылка
		|			И БухПартииЦенныхБумагОстаткиЕПС.СтрокаПартии = СделкаЦенныеБумаги.СтрокаПартии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|		ПО БухПартииЦенныхБумагОстаткиЕПС.УчетныйАктивЕПС = УчетныеАктивыЕПС.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг.СрезПоследних КАК НоминалыЦенныхБумагСрезПоследних
		|		ПО БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага = НоминалыЦенныхБумагСрезПоследних.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеклассификацияАктивовЕПС.Партии КАК РеклассификацияАктивовЕПСПартии
		|		ПО БухПартииЦенныхБумагОстаткиЕПС.ЦеннаяБумага = РеклассификацияАктивовЕПСПартии.Ссылка.ЦеннаяБумага
		|			И БухПартииЦенныхБумагОстаткиЕПС.Партия = РеклассификацияАктивовЕПСПартии.Ссылка
		|			И БухПартииЦенныхБумагОстаткиЕПС.СтрокаПартии = РеклассификацияАктивовЕПСПартии.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НалоговыйУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	НалоговыйУчетОстатки.СуммаОстатокДт КАК Сумма
		|ПОМЕСТИТЬ _ПогашениеНУ
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.Остатки(
		|			&ОтчетнаяДата,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК НалоговыйУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстатки.Субконто1 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОстатки.СуммаОстатокДт КАК Сумма
		|ПОМЕСТИТЬ _ПогашениеЕПС
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
		|			&ОтчетнаяДата,
		|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДолговыеПрибыльУбыток)),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦенныеБумаги),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ЛицевойСчет.ДополнительнаяАналитика В (ЗНАЧЕНИЕ(Справочник.ДополнительныеАналитикиЛицевыхСчетов.ЗадолженностьПоПогашениюКупона))) КАК ЕдиныйБухгалтерскийУчетОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	СУММА(_Сделки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ _ОстаткиЦБ
		|ИЗ
		|	_Сделки КАК _Сделки
		|
		|СГРУППИРОВАТЬ ПО
		|	_Сделки.ЦеннаяБумага
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).Номер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование) + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА """" + РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|			ТОГДА """" + ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|		ИНАЧЕ _Сделки.ЦеннаяБумага.Наименование
		|	КОНЕЦ КАК ЦеннаяБумагаНаименование,
		|	_Сделки.ISIN КАК ISIN,
		|	_Сделки.РегНомер КАК РегНомер,
		|	_Сделки.Партия КАК Партия,
		|	_Сделки.СтрокаПартии КАК СтрокаПартии,
		|	_Сделки.ДатаПартии КАК ДатаПартии,
		|	_Сделки.НомерСделки КАК НомерСделки,
		|	_Сделки.ВалютаНоминала КАК ВалютаНоминала,
		|	_Сделки.КоличествоОстаток КАК КоличествоОстаток,
		|	_Сделки.СтоимостьОстаток КАК СтоимостьОстаток,
		|	_Сделки.ОстатокДисконта КАК ОстатокДисконта,
		|	_Сделки.ОстатокПремия КАК ОстатокПремия,
		|	_Сделки.НКДуплаченный КАК НКДуплаченный,
		|	_Сделки.НКДНачисленный КАК НКДНачисленный,
		|	_Сделки.Переоценка КАК Переоценка,
		|	_Сделки.КомиссияОстаток КАК КомиссияОстаток,
		|	_Сделки.КоличествоПокупка КАК КоличествоПокупка,
		|	_Сделки.СуммаПокупка КАК СуммаПокупка,
		|	_Сделки.ЦенаПокупка КАК ЦенаПокупка,
		|	_Сделки.СуммаКупонаПокупка КАК СуммаКупонаПокупка,
		|	_КомиссияБрокера.КомиссияБрокера КАК КомиссияБрокера,
		|	_КомиссияБрокера.КомиссияБиржа КАК КомиссияБиржа,
		|	_Сделки.СтоимостьОстатокНУ + _Сделки.КомиссияОстатокНУ КАК СтоимостьОстатокНУ,
		|	_Сделки.НКДУплаченныйНУ КАК НКДУплаченныйНУ,
		|	_Сделки.НКДНачисленныйНУ КАК НКДНачисленныйНУ,
		|	_Сделки.КомиссияОстатокНУ КАК КомиссияОстатокНУ,
		|	_Сделки.СчетУчета КАК СчетУчета,
		|	_Сделки.ЦеннаяБумагаУчетныйАктивЦБРФ КАК УчетныйАктивЦБРФ,
		|	_Сделки.Номинал КАК Номинал,
		|	_Сделки.ДатаПогашения КАК ДатаПогашения,
		|	_Сделки.Основание.Дата КАК ВремяПартии,
		|	_Сделки.СтоимостьОстаток + _Сделки.ОстатокДисконта + _Сделки.ОстатокПремия + _Сделки.Переоценка + _Сделки.Корректировка + _Сделки.ИндексацияНоминала - _Сделки.СуммаРезервовПодОбесценение + _Сделки.НКДуплаченный + _Сделки.НКДНачисленный КАК БалансоваяСтоимостьИтого,
		|	_Сделки.СтоимостьОстаток + _Сделки.ОстатокДисконта + _Сделки.ОстатокПремия + _Сделки.Переоценка + _Сделки.Корректировка + _Сделки.ИндексацияНоминала - _Сделки.СуммаРезервовПодОбесценение КАК БалансоваяСтоимостьБезНКД,
		|	_Сделки.СтоимостьОстатокНУ + _Сделки.КомиссияОстатокНУ + _Сделки.НКДУплаченныйНУ + _Сделки.НКДНачисленныйНУ + _Сделки.ИндексацияНоминалаНУ - _Сделки.СуммаРезервовПодОбесценениеНУ КАК БалансоваяСтоимостьНУИтого,
		|	_СправедливыеЦены.ЦенаКотировки КАК СправедливаяЦена,
		|	МАКСИМУМ(НоминалыЦенныхБумагПокупка.Период) КАК ДатаНоминала,
		|	ЕСТЬNULL(НоминалыЦенныхБумаг.Номинал, _Сделки.Номинал) КАК НоминалПокупки,
		|	ЕСТЬNULL(НоминалыЦенныхБумаг.Номинал, _Сделки.Номинал) * _Сделки.КоличествоПокупка КАК НоминальнаяСтоимость,
		|	_Сделки.Корректировка КАК Корректировка,
		|	_Сделки.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценение,
		|	_Сделки.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгам,
		|	_Сделки.СуммаРезервовПодОбесценение КАК СуммаРезервовПодОбесценениеНУ,
		|	_Сделки.СуммаРезервовПоСомнительнымДолгам КАК СуммаРезервовПоСомнительнымДолгамНУ,
		|	КурсыВалют.Курс КАК Курс,
		|	_Сделки.ИндексацияНоминала КАК ИндексацияНоминала,
		|	_Сделки.ИндексацияНоминалаНУ КАК ИндексацияНоминалаНУ,
		|	_ОстаткиЦБ.КоличествоОстаток КАК ОстатокЦБ,
		|	ЕСТЬNULL(_ПогашениеЕПС.Сумма, 0) / _ОстаткиЦБ.КоличествоОстаток * _Сделки.КоличествоОстаток КАК ПогашенныйНКД_ЕПС,
		|	ЕСТЬNULL(_ПогашениеНУ.Сумма, 0) / _ОстаткиЦБ.КоличествоОстаток * _Сделки.КоличествоОстаток КАК ПогашенныйНКД_НУ
		|ИЗ
		|	_Сделки КАК _Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ _КомиссияБрокера КАК _КомиссияБрокера
		|		ПО _Сделки.Основание = _КомиссияБрокера.Основание
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СправедливыеЦены КАК _СправедливыеЦены
		|		ПО _Сделки.ЦеннаяБумага = _СправедливыеЦены.ЦеннаяБумага
		|			И (НАЧАЛОПЕРИОДА(_Сделки.ДатаПартии, ДЕНЬ) = НАЧАЛОПЕРИОДА(_СправедливыеЦены.Период, ДЕНЬ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумагПокупка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|			ПО НоминалыЦенныхБумагПокупка.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|				И НоминалыЦенныхБумагПокупка.Период = НоминалыЦенныхБумаг.Период
		|		ПО _Сделки.ЦеннаяБумага = НоминалыЦенныхБумагПокупка.ЦеннаяБумага
		|			И (НоминалыЦенныхБумагПокупка.Период < _Сделки.ДатаПартии)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО _Сделки.ВалютаНоминала = КурсыВалют.Валюта
		|			И (НАЧАЛОПЕРИОДА(_Сделки.ДатаПартии, ДЕНЬ) = КурсыВалют.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОстаткиЦБ КАК _ОстаткиЦБ
		|		ПО _Сделки.ЦеннаяБумага = _ОстаткиЦБ.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПогашениеЕПС КАК _ПогашениеЕПС
		|		ПО _Сделки.ЦеннаяБумага = _ПогашениеЕПС.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ПогашениеНУ КАК _ПогашениеНУ
		|		ПО _Сделки.ЦеннаяБумага = _ПогашениеНУ.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ОтчетнаяДата,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|					ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|					ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|					ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ОтчетнаяДата, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО _Сделки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ОтчетнаяДата, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|					ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ОтчетнаяДата, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
		|		ПО _Сделки.ЦеннаяБумага = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект
		|
		|СГРУППИРОВАТЬ ПО
		|	НоминалыЦенныхБумагПокупка.ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Акции)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Акции).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Векселя)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).Номер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).Номер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Векселя).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Доли)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Доли).ЮрЛицо.Наименование) + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Доли).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Облигации)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Облигации).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.Паи)
		|			ТОГДА """" + РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Сделки.ЦеннаяБумага КАК Справочник.Паи).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Сделки.ЦеннаяБумага) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|			ТОГДА """" + ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|		ИНАЧЕ _Сделки.ЦеннаяБумага.Наименование
		|	КОНЕЦ,
		|	_Сделки.ЦеннаяБумага,
		|	_Сделки.ISIN,
		|	_Сделки.РегНомер,
		|	_Сделки.Партия,
		|	_Сделки.СтрокаПартии,
		|	_Сделки.ДатаПартии,
		|	_Сделки.НомерСделки,
		|	_Сделки.ВалютаНоминала,
		|	_Сделки.КоличествоОстаток,
		|	_Сделки.СтоимостьОстаток,
		|	_Сделки.ОстатокДисконта,
		|	_Сделки.ОстатокПремия,
		|	_Сделки.НКДуплаченный,
		|	_Сделки.НКДНачисленный,
		|	_Сделки.Переоценка,
		|	_Сделки.КомиссияОстаток,
		|	_Сделки.КоличествоПокупка,
		|	_Сделки.СуммаПокупка,
		|	_Сделки.ЦенаПокупка,
		|	_Сделки.СуммаКупонаПокупка,
		|	_КомиссияБрокера.КомиссияБрокера,
		|	_КомиссияБрокера.КомиссияБиржа,
		|	_Сделки.СтоимостьОстатокНУ,
		|	_Сделки.НКДУплаченныйНУ,
		|	_Сделки.НКДНачисленныйНУ,
		|	_Сделки.КомиссияОстатокНУ,
		|	_Сделки.СчетУчета,
		|	_Сделки.ЦеннаяБумагаУчетныйАктивЦБРФ,
		|	_Сделки.Номинал,
		|	_Сделки.ДатаПогашения,
		|	_Сделки.Основание.Дата,
		|	_СправедливыеЦены.ЦенаКотировки,
		|	НоминалыЦенныхБумаг.Номинал,
		|	_Сделки.Корректировка,
		|	_Сделки.СуммаРезервовПодОбесценение,
		|	_Сделки.СуммаРезервовПоСомнительнымДолгам,
		|	_Сделки.СуммаРезервовПодОбесценениеНУ,
		|	_Сделки.СуммаРезервовПоСомнительнымДолгамНУ,
		|	КурсыВалют.Курс,
		|	_Сделки.ИндексацияНоминала,
		|	_Сделки.ИндексацияНоминалаНУ,
		|	_ОстаткиЦБ.КоличествоОстаток,
		|	_ПогашениеЕПС.Сумма,
		|	_ПогашениеНУ.Сумма,
		|	_Сделки.СуммаРезервовПодОбесценение,
		|	_Сделки.СуммаРезервовПоСомнительнымДолгам
		|ИТОГИ
		|	СУММА(КоличествоОстаток),
		|	СУММА(СтоимостьОстаток),
		|	СУММА(ОстатокДисконта),
		|	СУММА(ОстатокПремия),
		|	СУММА(НКДуплаченный),
		|	СУММА(НКДНачисленный),
		|	СУММА(Переоценка),
		|	СУММА(КомиссияОстаток),
		|	СУММА(КоличествоПокупка),
		|	СУММА(СуммаПокупка),
		|	СУММА(СуммаКупонаПокупка),
		|	СУММА(КомиссияБрокера),
		|	СУММА(КомиссияБиржа),
		|	СУММА(СтоимостьОстатокНУ),
		|	СУММА(НКДУплаченныйНУ),
		|	СУММА(НКДНачисленныйНУ),
		|	СУММА(КомиссияОстатокНУ),
		|	СУММА(БалансоваяСтоимостьИтого),
		|	СУММА(БалансоваяСтоимостьБезНКД),
		|	СУММА(БалансоваяСтоимостьНУИтого),
		|	СУММА(НоминальнаяСтоимость),
		|	СУММА(Корректировка),
		|	СУММА(СуммаРезервовПодОбесценение),
		|	СУММА(СуммаРезервовПоСомнительнымДолгам),
		|	СУММА(СуммаРезервовПодОбесценениеНУ),
		|	СУММА(СуммаРезервовПоСомнительнымДолгамНУ),
		|	СУММА(ИндексацияНоминала),
		|	СУММА(ИндексацияНоминалаНУ),
		|	СУММА(ПогашенныйНКД_ЕПС),
		|	СУММА(ПогашенныйНКД_НУ)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ОтчетнаяДата", Новый Граница(ЭтотОбъект.Период.ДатаОкончания, ВидГраницы.Включая));
		
	//вывод формы
	Отчет = ПолучитьМакет("Макет");	
	ОбластьШапка = Отчет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Отчет.ПолучитьОбласть("Строка");
	ОбластьИтог = Отчет.ПолучитьОбласть("Итог");
	
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(Период.ДатаОкончания, Организация, СчетДоверительногоУправления);
	Портфель = Строка(ПараметрыШапки.УчредительУправления) + ", Договор №" + ПараметрыШапки.НомерДоговора +" от " + Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");	
	
	ОбластьШапка.Параметры.Портфель	= Портфель;
	ОбластьШапка.Параметры.ПериодОтчета = Формат(ЭтотОбъект.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.ДоверительныйУправляющий	= ПараметрыШапки.ДоверительныйУправляющий;

	Биржа = ОбщегоНазначения.ПолучитьИменованныйОбъект("ММВБ-РТС").Биржа;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл 
		
		ВыборкаСтрока = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);	
		
		Пока ВыборкаСтрока.Следующий() Цикл	
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаСтрока);
			ОбластьСтрока.Параметры.Портфель = Портфель;
			
			//ЭСП
			Если ТипЗнч(ВыборкаСтрока.ЦеннаяБумага) = Тип("СправочникСсылка.Облигации") Тогда  
				ДоходностьДюрация = Справочники.Облигации.ПолучитьДоходностьИДюрацию(
				ВыборкаСтрока.ЦеннаяБумага,
				Ложь,
				ВыборкаСтрока.ДатаПартии,
				ВыборкаСтрока.ЦенаПокупка,
				ЭтотОбъект.СчетДоверительногоУправления,
				Биржа);
				
				Если ТипЗнч(ДоходностьДюрация) = Тип("Структура") Тогда
					ОбластьСтрока.Параметры.ЭСП = ДоходностьДюрация.Доходность;
				КонецЕсли; 
				
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьСтрока);
		КонецЦикла;	
		
		ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, Выборка);
		ДокументРезультат.Вывести(ОбластьИтог);
		
	КонецЦикла;	

	//подписи
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
			
    РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
